---
type: PlanarFace
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# PlanarFace

`Autodesk.Revit.DB.PlanarFace` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Method | Triangulate | — | `` |
| Property | FaceNormal | — | `public XYZ FaceNormal { get ; }` |
| Property | Origin | — | `public XYZ Origin { get ; }` |
| Property | XVector | — | `public XYZ XVector { get ; }` |
| Property | YVector | — | `public XYZ YVector { get ; }` |